{
	"properties": [
		{
			"defaultValue": "false",
			"name": "spring.cloud.stream.override-cloud-connectors",
			"description": "This property is only applicable when the cloud profile is active and Spring Cloud Connectors are provided with the application. If the property is false (the default), the binder detects a suitable bound service (for example, a RabbitMQ service bound in Cloud Foundry for the RabbitMQ binder) and uses it for creating connections (usually through Spring Cloud Connectors). When set to true, this property instructs binders to completely ignore the bound services and rely on Spring Boot properties (for example, relying on the spring.rabbitmq.* properties provided in the environment for the RabbitMQ binder). The typical usage of this property is to be nested in a customized environment when connecting to multiple systems.",
			"type": "java.lang.Boolean"
		},
		{
			"defaultValue": "true",
			"name": "management.health.binders.enabled",
			"description": "Allows to enable/disable binder's' health indicators. If you want to disable health indicator completely, then set it to `false`.",
			"type": "java.lang.Boolean"
		},
		{
			"defaultValue": "none",
			"name": "spring.cloud.stream.sendto.destination",
			"description": "The name of the header used to determine the name of the output destination",
			"type": "java.lang.String"
		},
		{
			"defaultValue": "none",
			"name": "spring.cloud.stream.pollable-source",
			"description": "A semi-colon delimited list of binding names of pollable sources. Binding names follow the same naming convention as functions. For example, name '...pollable-source=foobar' will be accessible as 'foobar-iin-0'' binding",
			"type": "java.lang.String"
		},
		{
			"defaultValue": "none",
			"name": "spring.cloud.stream.default.binder",
			"description": "The name of the default binder to use when multiple binders are present",
			"type": "java.lang.String"
		},
		{
			"defaultValue": "none",
			"name": "spring.cloud.stream.default.group",
			"description": "The name of the default consumer group",
			"type": "java.lang.String"
		},
		{
			"defaultValue": "none",
			"name": "spring.cloud.stream.default.content-type",
			"description": "The name of the default content type to apply for Message conversion",
			"type": "java.lang.String"
		},
		{
			"defaultValue": "none", 
			"name": "spring.cloud.stream.default.consumer.concurrency",
			"description": "Default concurrency settings",
			"type": "java.lang.String"
		},
		{
			"defaultValue": "true",
			"name": "spring.cloud.stream.function.autodetect",
			"description": "Auto-discovers and binds a single function. However, it is primarily used to disable function auto-discovery.",
			"type": "java.lang.Boolean"
		}
		
	]
}
